app/views/users/homepage.html.erb

SELECT "run_routes".* FROM "run_routes" WHERE "run_routes"."user_id" = ?  [["user_id", 1]]
---
					<!-- <button type="button" class="btn btn-success btn-lg btn-block" style = "font-size: 18pt; margin-bottom: 10px;"><%#= link_to 'Create a new route', routeplanner_path, :style => "color: white; text-decoration: none;" %></button> -->
					<% current_user.run_routes.each do |route| %>