app/views/users/search.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
				<% end %>
				<%= render 'partials/user_info', user: User.find(@user_ids[index]), friend_status: status %>