app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def search
		@user_ids = User.search_people(params[:search])
		if @user_ids.include? (current_user.id)